import com.example.equabase.SubCategoryType
import com.example.equabase.data.PhysicsFormula

object PressureFormulas {

    private fun formula(
        name: String,
        formula: String,
        description: String
    ) = PhysicsFormula(name, formula, description, SubCategoryType.PRESSURE)

    val list = listOf(
        formula("Тиск", "p = F/S", "Тиск — це відношення сили до площі: де p — тиск, F — сила, S — площа поверхні."),
        formula("Гідростатичний тиск", "p = ρ*g*h", "Тиск рідини на глибину: ρ — густина, g — прискорення вільного падіння, h — глибина."),
        formula("Повний тиск", "p = p_0 + ρ*g*h", "Повний тиск — це сума атмосферного та гідростатичного тиску."),
        formula("Атмосферний тиск", "p_0 = F/S", "Атмосферний тиск — тиск повітря на площу: F — сила, S — площа."),
        formula("Закон Паскаля", "p_1 = p_2", "Зміна тиску в рідині передається однаково в усіх напрямках."),
        formula("Закон Архімеда", "F_A = ρ*g*V", "Сила Архімеда: ρ — густина рідини, g — прискорення вільного падіння, V — об’єм витісненої рідини."),
        formula("Умова плавання тіла", "ρ_т = ρ_р", "Тіло плаває, коли його густина дорівнює густині рідини."),
        formula("Тиск і температура (ізобарний процес)", "V/T = const", "При сталому тиску об'єм газу пропорційний температурі."),
        formula("Закон Бойля-Маріотта", "p*V = const", "При сталій температурі добуток тиску на об'єм залишається незмінним."),
        formula("Закон Гей-Люссака", "p/T = const", "При сталому об'ємі тиск газу пропорційний температурі."),
        formula("Закон Авогадро", "V/n = const", "Один моль будь-якого газу займає однаковий об’єм за однакових умов."),
        formula("Ізотермічне розширення", "p_1*V_1 = p_2*V_2", "Закон Бойля-Маріотта для двох станів газу."),
        formula("Ізобарне розширення", "V_1/T_1 = V_2/T_2", "Закон Гей-Люссака для двох станів газу."),
        formula("Ізохорне нагрівання", "p_1/T_1 = p_2/T_2", "Закон Шарля для двох станів газу."),
        formula("Рівняння Менделєєва-Клапейрона", "p*V = n*R*T", "Основне рівняння стану ідеального газу."),
        formula("Середній тиск газу", "p = (1/3)*ρ*v^2", "Середній тиск газу визначається через густину та середню квадратичну швидкість молекул."),
        formula("Сполучені посудини", "h_1*ρ_1 = h_2*ρ_2", "У сполучених посудинах рідини встановлюються так, щоб тиск був однаковий."),
        formula("Об'єм поточної по трубі рідини", "V = S*v*t", "Об'єм рідини, що протікає, обчислюється за площею перерізу, швидкістю і часом."),
        formula("Швидкість витікання рідини з отвору", "v = √{{2*p}/ρ}", "v - швидкість p - тиск ρ - густина")
    )
}