import com.example.equabase.SubCategoryType
import com.example.equabase.data.PhysicsFormula

object ThermodynamicsFormulas {

    private fun formula(
        name: String,
        formula: String,
        description: String
    ) = PhysicsFormula(name, formula, description, SubCategoryType.THERMODYNAMIC)

    val list = listOf(
        formula("Внутрішня енергія одноатомного газу (через масу)", "U = {3*m*R*T}/{2*M}", "U — внутрішня енергія газу, m — маса, R — універсальна газова стала, T — температура, M — молярна маса."),
        formula("Внутрішня енергія одноатомного газу (через кількість речовини)", "U = {3*ν*R*T}/2", "U — внутрішня енергія газу, ν — кількість речовини, R — універсальна газова стала, T — температура."),
        formula("Питома теплоємність газу", "c = {3*R}/2*M", "c — питома теплоємність, R — універсальна газова стала, M — молярна маса."),
        formula("Робота розширення газу", "A = p*ΔV", "A — робота, p — тиск, ΔV — зміна об'єму."),
        formula("Робота ізотермічного розширення газу", "A = {m*R*T}/M*ln(V₂/V₁)", "A — робота, m — маса, R — універсальна газова стала, T — температура, M — молярна маса, V₂ — кінцевий об'єм, V₁ — початковий об'єм."),
        formula("Перший закон термодинаміки", "ΔU = A + Q", "ΔU — зміна внутрішньої енергії, A — робота, Q — кількість теплоти."),
        formula("ККД теплового двигуна (через роботу)", "η = Aₙ/Q₁", "η — коефіцієнт корисної дії, Aₙ — корисна робота, Q₁ — кількість теплоти, отриманої від нагрівача."),
        formula("ККД теплового двигуна (через теплоту)", "η = {Q₁ - Q₂}/Q₁", "η — коефіцієнт корисної дії, Q₁ — кількість теплоти, отриманої від нагрівача, Q₂ — кількість теплоти, переданої холодильнику."),
        formula("Максимальний ККД теплового двигуна", "η_max = {T₁ - T₂}/T₁", "η_max — максимальний коефіцієнт корисної дії, T₁ — температура нагрівача, T₂ — температура холодильника.")
    )
}